brew "git"
brew "asdf"
brew "bat"
brew "bottom"
brew "chezmoi"
brew "cocoapods"
brew "ripgrep"
brew "codex"
brew "colima"
brew "curl"
brew "dust"
brew "eza"
brew "fd"
brew "fortune"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "htop"
brew "httpie"
brew "jq"
brew "neovim"
brew "nushell"
brew "peco"
brew "procs"
brew "starship"
brew "supabase-mcp-server"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "font-cica"
cask "font-jetbrains-mono-nerd-font"
cask "temurin"
