# Brewfile - Homebrew依存関係管理
# このファイルで管理されたツールは `brew bundle` で一括インストール可能

# 基本的な開発ツール
brew "git"
brew "tree"
brew "curl"
brew "wget"

# 新しいUNIXツールの代替
brew "ripgrep"      # grep代替
brew "fd"           # find代替
brew "bat"          # cat代替
brew "eza"          # ls代替（ezaはexaの後継）
brew "procs"        # ps代替
brew "dust"         # du代替
brew "bottom"       # top代替
brew "zoxide"       # cd代替

# ファジーファインダー
brew "fzf"

# 開発ツール
brew "gh"           # GitHub CLI
brew "neovim"
brew "tmux"
brew "ghq"          # リポジトリ管理
brew "chezmoi"      # dotfiles管理
brew "delta"        # git diff改善
brew "htop"
brew "jq"           # JSON処理
brew "yq"           # YAML処理
brew "asdf"         # 言語バージョン管理

# zsh拡張
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# プロンプト
brew "starship"

# その他便利ツール
brew "httpie"       # curl代替
brew "tldr"         # man代替
brew "trash"        # rm代替

# 言語系（asdfでも管理可能だが、開発ツールとして）
brew "node"         # Node.js（asdfと併用時は優先度で制御）

# Cask（GUI アプリケーション）- 必要に応じてコメントアウト
# cask "iterm2"
# cask "visual-studio-code"
# cask "docker"
